In [ ]:
#-- SQL Retail Sales Analysis

In [1]:
%load_ext sql

In [12]:
%sql mysql+mysqlconnector://root:Vyshu%401234@localhost:3306

In [ ]:
#creating database

In [140]:
%%sql
DROP DATABASE IF EXISTS sql_project;
CREATE DATABASE sales_analyzer_db;

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
1 rows affected.
1 rows affected.

[]

In [141]:
%%sql
use sales_analyzer_db;

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
0 rows affected.

[]

In [ ]:
## Connect to the MySQL 'sql_project' database with local CSV loading enabled

In [142]:
%sql mysql+mysqlconnector://root:Vyshu%401234@localhost:3306/sales_analyzer_db?allow_local_infile=1

In [ ]:
# Create TABLE

In [143]:
%%sql 
DROP TABLE IF EXISTS retail_sales;
CREATE TABLE retail_sales
            (
                transaction_id INT PRIMARY KEY,	
                sale_date DATE,	 
                sale_time TIME,	
                customer_id	INT,
                gender	VARCHAR(15),
                age	INT,
                category VARCHAR(15),	
                quantity	INT,
                price_per_unit FLOAT,	
                cogs	FLOAT,
                total_sale FLOAT
            );

   mysql+mysqlconnector://root:***@localhost:3306
 * mysql+mysqlconnector://root:***@localhost:3306/sales_analyzer_db?allow_local_infile=1
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
   mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
0 rows affected.
0 rows affected.

[]

In [ ]:
# Load data from 'retail_sales.csv' into the retail_sales table

In [144]:
%%sql
LOAD DATA LOCAL INFILE 'retail_sales.csv'
INTO TABLE retail_sales
FIELDS TERMINATED BY ',' 
ENCLOSED BY '"'
LINES TERMINATED BY '\n'
IGNORE 1 ROWS;

   mysql+mysqlconnector://root:***@localhost:3306
 * mysql+mysqlconnector://root:***@localhost:3306/sales_analyzer_db?allow_local_infile=1
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
   mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
2000 rows affected.

[]

In [ ]:
#Data Exploration

In [ ]:
# Display the first 10 rows from the retail_sales table

In [145]:
%%sql
select * from retail_sales limit 10;

   mysql+mysqlconnector://root:***@localhost:3306
 * mysql+mysqlconnector://root:***@localhost:3306/sales_analyzer_db?allow_local_infile=1
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
   mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
10 rows affected.

[(1, datetime.date(2022, 12, 16), datetime.timedelta(seconds=69000), 50, 'Male', 34, 'Beauty', 3, 50.0, 16.0, 150.0),
 (2, datetime.date(2022, 6, 24), datetime.timedelta(seconds=36420), 104, 'Female', 26, 'Clothing', 2, 500.0, 135.0, 1000.0),
 (3, datetime.date(2022, 6, 14), datetime.timedelta(seconds=25680), 114, 'Male', 50, 'Electronics', 1, 30.0, 8.1, 30.0),
 (4, datetime.date(2023, 8, 27), datetime.timedelta(seconds=65520), 3, 'Male', 37, 'Clothing', 1, 500.0, 200.0, 500.0),
 (5, datetime.date(2023, 9, 5), datetime.timedelta(seconds=79800), 3, 'Male', 30, 'Beauty', 2, 50.0, 24.0, 100.0),
 (6, datetime.date(2023, 11, 15), datetime.timedelta(seconds=80160), 2, 'Female', 45, 'Beauty', 1, 30.0, 15.0, 30.0),
 (7, datetime.date(2023, 7, 6), datetime.timedelta(seconds=23040), 38, 'Male', 46, 'Clothing', 2, 25.0, 13.25, 50.0),
 (8, datetime.date(2022, 12, 27), datetime.timedelta(seconds=40740), 148, 'Male', 30, 'Electronics', 4, 25.0, 11.0, 100.0),
 (9, datetime.date(2022, 12, 2), datetime.timedelta(seconds=47520), 85, 'Male', 63, 'Electronics', 2, 300.0, 78.0, 600.0),
 (10, datetime.date(2022, 10, 24), datetime.timedelta(seconds=82500), 81, 'Female', 52, 'Clothing', 4, 50.0, 62.5, 200.0)]

In [ ]:
# Get the total number of sales in the retail_sales table

In [146]:
%%sql
SELECT COUNT(total_sale) AS Number_of_sales
FROM retail_sales;

   mysql+mysqlconnector://root:***@localhost:3306
 * mysql+mysqlconnector://root:***@localhost:3306/sales_analyzer_db?allow_local_infile=1
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
   mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
1 rows affected.

[(2000,)]

In [ ]:
# Check column names and data types

In [147]:
%%sql
DESCRIBE retail_sales;

   mysql+mysqlconnector://root:***@localhost:3306
 * mysql+mysqlconnector://root:***@localhost:3306/sales_analyzer_db?allow_local_infile=1
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
   mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
11 rows affected.

[('transaction_id', 'int', 'NO', 'PRI', None, ''),
 ('sale_date', 'date', 'YES', '', None, ''),
 ('sale_time', 'time', 'YES', '', None, ''),
 ('customer_id', 'int', 'YES', '', None, ''),
 ('gender', 'varchar(15)', 'YES', '', None, ''),
 ('age', 'int', 'YES', '', None, ''),
 ('category', 'varchar(15)', 'YES', '', None, ''),
 ('quantity', 'int', 'YES', '', None, ''),
 ('price_per_unit', 'float', 'YES', '', None, ''),
 ('cogs', 'float', 'YES', '', None, ''),
 ('total_sale', 'float', 'YES', '', None, '')]

In [ ]:
# Total Number of Unique Customers

In [46]:
%%sql
SELECT DISTINCT COUNT(customer_id) AS Unique_Customers
FROM retail_sales;

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
1 rows affected.

[(2000,)]

In [ ]:
# List of Unique Product Categories in Retail Sales

In [50]:
%%sql
SELECT DISTINCT category FROM retail_sales;

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
3 rows affected.

[('Beauty',), ('Clothing',), ('Electronics',)]

In [ ]:
# Data Cleaning

In [ ]:
#Remove duplicate rows

In [30]:
%%sql
SELECT transaction_id, COUNT(*) 
FROM retail_sales
GROUP BY transaction_id 
HAVING COUNT(*) >1

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
0 rows affected.

[]

In [ ]:
#Handle NULL or Missing Values

In [33]:
%%sql
SELECT * FROM retail_sales
WHERE 
transaction_id IS NULL
OR
sale_date IS NULL
OR
sale_time IS NULL
OR
gender IS NULL
OR
category IS NULL
OR
quantity IS NULL
OR
cogs IS NULL
OR
total_sale IS NULL

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
0 rows affected.

[]

In [32]:
%%sql
SELECT * FROM retail_sales
WHERE sale_date IS NULL

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
0 rows affected.

[]

In [34]:
# Trim Extra Spaces

In [41]:
%%sql
UPDATE retail_sales
SET gender = TRIM(gender)

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
2000 rows affected.

[]

In [42]:
%%sql
UPDATE retail_sales
SET category = TRIM(category)

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
2000 rows affected.

[]

In [ ]:
# Data Analysis & Business Key Problems & Answers

In [ ]:
# Q.1 Write a SQL query to retrieve all columns for sales made on 2022-06-24

In [55]:
%%sql
SELECT * FROM retail_sales
WHERE sale_date = '2022-06-24'

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
2 rows affected.

[(2, datetime.date(2022, 6, 24), datetime.timedelta(seconds=36420), 104, 'Female', 26, 'Clothing', 2, 500.0, 135.0, 1000.0),
 (495, datetime.date(2022, 6, 24), datetime.timedelta(seconds=75960), 131, 'Male', 24, 'Beauty', 2, 30.0, 11.7, 60.0)]

In [ ]:
# Q.2 Write a SQL query to retrieve all transactions where the category is 'Clothing' and the quantity sold is more than 4 in the month of Nov-2022

In [86]:
%%sql
SELECT * FROM retail_sales
WHERE category = 'Clothing'
and
DATE_FORMAT(sale_date, '%Y-%m') = '2022-11'
and
quantity >= 4;

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
17 rows affected.

[(64, datetime.date(2022, 11, 15), datetime.timedelta(seconds=23640), 7, 'Male', 49, 'Clothing', 4, 25.0, 8.5, 100.0),
 (146, datetime.date(2022, 11, 10), datetime.timedelta(seconds=79260), 74, 'Male', 38, 'Clothing', 4, 50.0, 49.0, 200.0),
 (159, datetime.date(2022, 11, 10), datetime.timedelta(seconds=77400), 42, 'Male', 26, 'Clothing', 4, 50.0, 23.5, 200.0),
 (284, datetime.date(2022, 11, 12), datetime.timedelta(seconds=33420), 129, 'Male', 43, 'Clothing', 4, 50.0, 20.5, 200.0),
 (547, datetime.date(2022, 11, 14), datetime.timedelta(seconds=27360), 3, 'Male', 63, 'Clothing', 4, 500.0, 250.0, 2000.0),
 (699, datetime.date(2022, 11, 21), datetime.timedelta(seconds=80460), 129, 'Female', 37, 'Clothing', 4, 30.0, 16.2, 120.0),
 (735, datetime.date(2022, 11, 26), datetime.timedelta(seconds=77880), 153, 'Female', 64, 'Clothing', 4, 500.0, 515.0, 2000.0),
 (943, datetime.date(2022, 11, 5), datetime.timedelta(seconds=70140), 90, 'Female', 57, 'Clothing', 4, 300.0, 318.0, 1200.0),
 (965, datetime.date(2022, 11, 27), datetime.timedelta(seconds=78300), 84, 'Male', 22, 'Clothing', 4, 50.0, 13.0, 200.0),
 (1259, datetime.date(2022, 11, 3), datetime.timedelta(seconds=63060), 105, 'Female', 45, 'Clothing', 4, 50.0, 21.0, 200.0),
 (1296, datetime.date(2022, 11, 26), datetime.timedelta(seconds=74520), 45, 'Female', 22, 'Clothing', 4, 300.0, 342.0, 1200.0),
 (1476, datetime.date(2022, 11, 11), datetime.timedelta(seconds=80820), 130, 'Female', 27, 'Clothing', 4, 500.0, 555.0, 2000.0),
 (1484, datetime.date(2022, 11, 23), datetime.timedelta(seconds=34140), 22, 'Female', 19, 'Clothing', 4, 300.0, 147.0, 1200.0),
 (1497, datetime.date(2022, 11, 19), datetime.timedelta(seconds=78240), 109, 'Male', 41, 'Clothing', 4, 30.0, 32.4, 120.0),
 (1615, datetime.date(2022, 11, 17), datetime.timedelta(seconds=49380), 82, 'Female', 61, 'Clothing', 4, 25.0, 13.5, 100.0),
 (1696, datetime.date(2022, 11, 21), datetime.timedelta(seconds=64740), 24, 'Female', 50, 'Clothing', 4, 50.0, 55.0, 200.0),
 (1885, datetime.date(2022, 11, 9), datetime.timedelta(seconds=27120), 148, 'Female', 52, 'Clothing', 4, 30.0, 10.8, 120.0)]

In [87]:
#Q.3 Write a SQL query to calculate the total sales (total_sale) for each category.

In [92]:
%%sql
SELECT 
 category,sum(total_sale) As Total_sale
 FROM retail_sales
 GROUP BY category

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
3 rows affected.

[('Beauty', 286840.0), ('Clothing', 311070.0), ('Electronics', 313810.0)]

In [ ]:
#Q.4 Write a SQL query to find the average age of customers who purchased items from the 'Beauty' category.

In [95]:
%%sql
SELECT 
ROUND(AVG(age)) AS Average_age_of_customers 
FROM retail_sales
WHERE category = 'Beauty'

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
1 rows affected.

[(Decimal('40'),)]

In [96]:
#Q.5 Write a SQL query to find all transactions where the total_sale is greater than 1000.

In [121]:
%%sql
SELECT * FROM retail_sales
WHERE total_sale > 1000
LIMIT 10

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
10 rows affected.

[(13, datetime.date(2023, 2, 8), datetime.timedelta(seconds=63780), 106, 'Male', 22, 'Electronics', 3, 500.0, 245.0, 1500.0),
 (15, datetime.date(2022, 7, 1), datetime.timedelta(seconds=42600), 75, 'Female', 42, 'Electronics', 4, 500.0, 210.0, 2000.0),
 (16, datetime.date(2022, 6, 25), datetime.timedelta(seconds=37980), 82, 'Male', 19, 'Clothing', 3, 500.0, 180.0, 1500.0),
 (31, datetime.date(2023, 12, 31), datetime.timedelta(seconds=64020), 3, 'Male', 44, 'Electronics', 4, 300.0, 129.0, 1200.0),
 (46, datetime.date(2022, 11, 8), datetime.timedelta(seconds=64200), 54, 'Female', 20, 'Electronics', 4, 300.0, 84.0, 1200.0),
 (47, datetime.date(2022, 10, 22), datetime.timedelta(seconds=62520), 96, 'Female', 40, 'Beauty', 3, 500.0, 600.0, 1500.0),
 (54, datetime.date(2022, 10, 20), datetime.timedelta(seconds=37020), 142, 'Female', 38, 'Electronics', 3, 500.0, 200.0, 1500.0),
 (58, datetime.date(2023, 9, 16), datetime.timedelta(seconds=69480), 53, 'Male', 18, 'Clothing', 4, 300.0, 75.0, 1200.0),
 (65, datetime.date(2022, 12, 11), datetime.timedelta(seconds=72180), 84, 'Male', 51, 'Electronics', 4, 500.0, 160.0, 2000.0),
 (67, datetime.date(2023, 8, 19), datetime.timedelta(seconds=73140), 119, 'Female', 48, 'Beauty', 4, 300.0, 129.0, 1200.0)]

In [98]:
#Q.6 Write a SQL query to find the total number of transactions (transaction_id) made by each gender in each category.

In [104]:
%%sql
SELECT
    category,
    gender,
    COUNT(*) AS Total_no_of_Transactions
FROM retail_sales
GROUP BY gender,category
ORDER BY 1

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
6 rows affected.

[('Beauty', 'Male', 282),
 ('Beauty', 'Female', 332),
 ('Clothing', 'Female', 348),
 ('Clothing', 'Male', 354),
 ('Electronics', 'Male', 344),
 ('Electronics', 'Female', 340)]

In [ ]:
#Q.7 Write a SQL query to calculate the average sale for each month. Find out best selling month in each year

In [109]:
%%sql
SELECT 
       Year,
       Month,
       Average_sales
FROM 
(
    SELECT 
        YEAR(sale_date) AS Year,
        MONTH(sale_date) AS Month,
        AVG(total_sale) AS Average_sales,
        RANK()OVER(PARTITION BY YEAR(sale_date) ORDER BY AVG(total_sale) DESC )AS Rank_Month
    FROM retail_sales
    GROUP BY YEAR(sale_date),MONTH(sale_date)
)
AS Monthly_rank
WHERE Rank_Month = 1

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
2 rows affected.

[(2022, 7, 528.452380952381), (2023, 2, 535.531914893617)]

In [ ]:
#Q.8 Write a SQL query to find the top 5 customers based on the highest total sales

In [122]:
%%sql
SELECT 
    customer_id,
    SUM(total_sale) AS Total_sales
FROM 
    retail_sales
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5;

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
5 rows affected.

[(3, 38440.0), (1, 30750.0), (5, 30405.0), (2, 25295.0), (4, 23580.0)]

In [ ]:
# Q.9 Write a SQL query to find the number of unique customers who purchased items from each category.

In [125]:
%%sql
SELECT 
    category,
    COUNT(DISTINCT customer_id)	AS Count_of_unique_customers
FROM    
    retail_sales
GROUP BY 
    category

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
3 rows affected.

[('Beauty', 141), ('Clothing', 149), ('Electronics', 144)]

In [ ]:
#Q.10 Write a SQL query to create each shift and sum of total sales (Example Morning <12, Afternoon Between 12 & 17, Evening >17)

In [133]:
%%sql
WITH shift_sale
AS
(
    SELECT 
        CASE
            WHEN HOUR(sale_time) < 12 THEN 'Morning'
            WHEN HOUR(sale_time) BETWEEN 12 AND 17 THEN 'Afternoon'
            ELSE 'Evening'
         END AS shift,
        total_sale
    FROM 
        retail_sales
)
SELECT 
    shift,
    SUM(total_sale) AS Total_sale
FROM 
    shift_sale
GROUP BY 
    shift

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
3 rows affected.

[('Evening', 475940.0), ('Morning', 259900.0), ('Afternoon', 175880.0)]

In [ ]:
#Q.11 How many customers made repeat purchases?

In [139]:
%%sql
SELECT 
    customer_id,
    COUNT(*) AS purchase_count
FROM 
    retail_sales
GROUP BY 
    customer_id
HAVING
purchase_count > 1
LIMIT 10

   mysql+mysqlconnector://root:***@localhost:3306
   mysql+mysqlconnector://root:***@localhost:3306/sql_project
 * mysql+mysqlconnector://root:***@localhost:3306/sql_project?allow_local_infile=1
10 rows affected.

[(50, 14),
 (104, 18),
 (114, 15),
 (3, 76),
 (2, 69),
 (38, 6),
 (148, 8),
 (85, 22),
 (81, 14),
 (151, 7)]

In [ ]:
# End of project